app/Controllers/ClientController.php

    public function getOperateurByNumero($numero_telephone)
    {
        $code = substr($numero_telephone, 0, 3);

        $db = \Config\Database::connect();

        $operateur = $db->table('Prefixe')
            ->select('Operateur.id_operateur, Operateur.nom')
            ->join('Operateur', 'Operateur.id_operateur = Prefixe.id_operateur')
            ->where('Prefixe.code', $code)
            ->where('Prefixe.actif', 1)
            ->get()
            ->getRowArray();
---
SELECT `Operateur`.`id_operateur`, `Operateur`.`nom`
FROM `Prefixe`
JOIN `Operateur` ON `Operateur`.`id_operateur` = `Prefixe`.`id_operateur`
WHERE `Prefixe`.`code` = '038'
AND `Prefixe`.`actif` = 1


        $db->transStart();

        $db->table('Compte')
            ->where('id_compte', $compte['id_compte'])
            ->update(['solde' => $compte['solde'] - $totalDebit]);

        $operationModel->insert([
            'id_type_operation'      => OperationModel::TYPE_RETRAIT,
            'id_compte_source'       => $compte['id_compte'],
            'id_compte_destination'  => null,
            'montant'                => $montant,
            'frais_appliques'        => $frais,
            'id_statut'              => OperationModel::STATUT_REUSSIE,
        ]);
---
UPDATE `Compte` SET `solde` = 20000
WHERE `id_compte` = 1
INSERT INTO `Operation` (`id_type_operation`, `id_compte_source`, `id_compte_destination`, `montant`, `frais_appliques`, `id_statut`) VALUES (1, NULL, 1, 20000, 0, 2)

    private function getCompteByIdClient(int $id_client)
    {
        $db = \Config\Database::connect();

        return $db->table('Compte')
            ->select('Client.numero_telephone, Client.nom, Compte.id_compte, Compte.solde')
            ->join('Client', 'Client.id_client = Compte.id_client')
            ->where('Compte.id_client', $id_client)
            ->get()
            ->getRowArray();
---
SELECT `Client`.`numero_telephone`, `Client`.`nom`, `Compte`.`id_compte`, `Compte`.`solde`
FROM `Compte`
JOIN `Client` ON `Client`.`id_client` = `Compte`.`id_client`
WHERE `Compte`.`id_client` = 1