app/Controllers/ClientController.php

SELECT `Client`.`numero_telephone`, `Client`.`nom`, `Compte`.`id_compte`, `Compte`.`solde`
FROM `Compte`
JOIN `Client` ON `Client`.`id_client` = `Compte`.`id_client`
WHERE `Compte`.`id_client` = 1
---
    private function getCompteByIdClient(int $id_client)
    {
        $db = \Config\Database::connect();

        return $db->table('Compte')
            ->select('Client.numero_telephone, Client.nom, Compte.id_compte, Compte.solde')
            ->join('Client', 'Client.id_client = Compte.id_client')
            ->where('Compte.id_client', $id_client)
            ->get()
            ->getRowArray();