app/Controllers/CommissionInterOperateurController.php

    public function config()
    {
        $operateurModel = new OperateurModel();
        $commissionModel = new CommissionInterOperateurModel();

        $operateurs = [];
        foreach ($operateurModel->findAll() as $operateur) {
---
SELECT *
FROM `Operateur`