app/Controllers/EpargneController.php

INSERT INTO `epargne` (`id_client`, `pourcentage`) VALUES (1, '20')
---
    public function insert(){
        $pourcentage =  trim($this->request->getVar('epargne'));
        $id_client = session()->get('id_client');
        $data =[
            'id_client'=> $id_client,
            'pourcentage'=> $pourcentage,
        ];
        $model = new EpargneModel();
        $success = $model->insert($data);