app/Controllers/GainController.php

SELECT *
FROM `Operateur`
---
    public function index()
    {
        $dateDebut = $this->request->getGet('date_debut');
        $dateFin   = $this->request->getGet('date_fin');

        $model = new OperationModel();
        $operations = $model->getOperationsPourGains($dateDebut, $dateFin);

        $operateurModel = new OperateurModel();
        $baremeFraisModel = new BaremeFraisModel();
        $commissionModel = new CommissionInterOperateurModel();
        $operateurs = [];

        foreach ($operateurModel->findAll() as $operateur) {