app/Controllers/OperationController.php

            $idOperateurClientDestinataire = (int) $operateurDestinataire['id_operateur'];


            $destinataire = $this->clientModel->where('numero_telephone', $numero)->first();
---
SELECT *
FROM `Client`
WHERE `numero_telephone` = '0381234567'
 LIMIT 1


            $this->compteModel->crediter($part['compte_destinataire']['id_compte'], $part['montant_envoye']);

            $this->operationModel->insert([
                'id_type_operation'     => OperationModel::TYPE_TRANSFERT,
                'id_compte_source'      => $compteExpediteur['id_compte'],
                'id_compte_destination' => $part['compte_destinataire']['id_compte'],
                'id_operateur_destination' => $idOperateurClientDestinataire,
                'montant'               => $part['montant_envoye'],
                'frais_appliques'       => $part['frais_transfert'],
                'id_statut'             => OperationModel::STATUT_REUSSIE,
            ]);
---
INSERT INTO `Operation` (`id_type_operation`, `id_compte_source`, `id_compte_destination`, `id_operateur_destination`, `montant`, `frais_appliques`, `id_statut`) VALUES (3, 1, 6, 2, 500, 50, 2)

    private function trouverTranche(int $idOperateur, int $idTypeOperation, float $montant): ?array
    {
        return $this->baremeFraisModel
            ->where('id_operateur', $idOperateur)
            ->where('id_type_operation', $idTypeOperation)
            ->where('montant_min <=', $montant)
            ->where('montant_max >=', $montant)
            ->first();
---
SELECT *
FROM `BaremeFrais`
WHERE `id_operateur` = 2
AND `id_type_operation` = 3
AND `montant_min` <= 100000
AND `montant_max` >= 100000
 LIMIT 1

    public function getOperateurByNumero(string $numeroTelephone): ?array
    {
        $code = substr($numeroTelephone, 0, 3);

        $db = Database::connect();

        $operateur = $db->table('Prefixe')
            ->select('Operateur.id_operateur, Operateur.nom')
            ->join('Operateur', 'Operateur.id_operateur = Prefixe.id_operateur')
            ->where('Prefixe.code', $code)
            ->where('Prefixe.actif', 1)
            ->get()
            ->getRowArray();
---
SELECT `Operateur`.`id_operateur`, `Operateur`.`nom`
FROM `Prefixe`
JOIN `Operateur` ON `Operateur`.`id_operateur` = `Prefixe`.`id_operateur`
WHERE `Prefixe`.`code` = '034'
AND `Prefixe`.`actif` = 1