app/Controllers/PrefixeController.php

SELECT *
FROM `Prefixe`
WHERE `Prefixe`.`id_prefixe` = '3'
SELECT *
FROM `Operateur`
---
    public function form()
    {
        $id = $this->request->getGet('id');

        $prefixeModel  = new PrefixeModel();
        $operateurModel = new OperateurModel();

        $prefixe = $id ? $prefixeModel->find($id) : null;

        return view('operateur/prefixe/form', [
            'prefixe'   => $prefixe,
            'operateurs' => $operateurModel->findAll()