app/Models/BaremeFraisModel.php

    public function getAllWithOperateurEtType()
    {
        return $this->select('BaremeFrais.id_bareme, BaremeFrais.montant_min, BaremeFrais.montant_max, BaremeFrais.valeur_frais,
                            TypeOperation.libelle as libelle_type_operation,
                            Operateur.id_operateur, Operateur.nom as nom_operateur')
                    ->join('TypeOperation', 'TypeOperation.id_type_operation = BaremeFrais.id_type_operation')
                    ->join('Operateur', 'Operateur.id_operateur = BaremeFrais.id_operateur')
                    ->orderBy('Operateur.nom')
                    ->orderBy('TypeOperation.libelle')
                    ->orderBy('BaremeFrais.montant_min')
                    ->findAll();
---
SELECT `BaremeFrais`.`id_bareme`, `BaremeFrais`.`montant_min`, `BaremeFrais`.`montant_max`, `BaremeFrais`.`valeur_frais`, `TypeOperation`.`libelle` as `libelle_type_operation`, `Operateur`.`id_operateur`, `Operateur`.`nom` as `nom_operateur`
FROM `baremefrais`
JOIN `TypeOperation` ON `TypeOperation`.`id_type_operation` = `BaremeFrais`.`id_type_operation`
JOIN `Operateur` ON `Operateur`.`id_operateur` = `BaremeFrais`.`id_operateur`
ORDER BY `Operateur`.`nom`, `TypeOperation`.`libelle`, `BaremeFrais`.`montant_min`

    public function calculerFrais(int $idOperateur, int $idTypeOperation, float $montant): float
    {
        $tranche = $this->where('id_operateur', $idOperateur)
                         ->where('id_type_operation', $idTypeOperation)
                         ->where('montant_min <=', $montant)
                         ->where('montant_max >=', $montant)
                         ->first();
---
SELECT *
FROM `BaremeFrais`
WHERE `id_operateur` = 1
AND `id_type_operation` = 2
AND `montant_min` <= 1000
AND `montant_max` >= 1000
 LIMIT 1