app/Models/CommissionInterOperateurModel.php

    public function getPourcentage(int $idOperateur): float
    {
        $ligne = $this->where('id_operateur', $idOperateur)->first();
---
SELECT *
FROM `CommissionInterOperateur`
WHERE `id_operateur` = 3
 LIMIT 1