app/Models/CompteModel.php

    public function findByIdClient(int $idClient): ?array
    {
        return $this->where('id_client', $idClient)->first();
---
SELECT *
FROM `Compte`
WHERE `id_client` = 1
 LIMIT 1

    public function getDetailAvecClient(int $idClient): ?array
    {
        return $this->select('Client.numero_telephone, Client.nom, Compte.id_compte, Compte.solde')
            ->join('Client', 'Client.id_client = Compte.id_client')
            ->where('Compte.id_client', $idClient)
            ->first();
---
SELECT `Client`.`numero_telephone`, `Client`.`nom`, `Compte`.`id_compte`, `Compte`.`solde`
FROM `Compte`
JOIN `Client` ON `Client`.`id_client` = `Compte`.`id_client`
WHERE `Compte`.`id_client` = 1
 LIMIT 1

    public function crediter(int $idCompte, float $montant): void
    {
        $this->db->table('Compte')
            ->where('id_compte', $idCompte)
            ->set('solde', 'solde + ' . $montant, false)
            ->update();
---
UPDATE `Compte` SET `solde` = solde + 500
WHERE `id_compte` = 6

    public function debiter(int $idCompte, float $montant): void
    {
        $this->db->table('Compte')
            ->where('id_compte', $idCompte)
            ->set('solde', 'solde - ' . $montant, false)
            ->update();
---
UPDATE `Compte` SET `solde` = solde - 500.5
WHERE `id_compte` = 1

    public function getAllWithClient(?string $recherche = null, ?int $idOperateur = null): array
    {
        $builder = $this->select('Compte.id_compte, Compte.solde, Client.id_client, Client.nom, Client.numero_telephone')
            ->join('Client', 'Client.id_client = Compte.id_client');

        if ($idOperateur !== null) {
            $builder->where('Client.id_operateur', $idOperateur);
        }

        if ($recherche) {
            $builder->groupStart()
                ->like('Client.nom', $recherche)
                ->orLike('Client.numero_telephone', $recherche)
                ->groupEnd();
        }

        return $builder->orderBy('Client.nom')->findAll();
---
SELECT `Compte`.`id_compte`, `Compte`.`solde`, `Client`.`id_client`, `Client`.`nom`, `Client`.`numero_telephone`
FROM `Compte`
JOIN `Client` ON `Client`.`id_client` = `Compte`.`id_client`
WHERE `Client`.`id_operateur` = 2
ORDER BY `Client`.`nom`