app/Models/CompteModel.php

    public function getAllWithClient(?string $recherche = null, ?int $idOperateur = null)
    {
        $builder = $this->select('Compte.id_compte, Compte.solde,
                                   Client.id_client, Client.numero_telephone, Client.nom,
                                   Operateur.nom as nom_operateur')
                         ->join('Client', 'Client.id_client = Compte.id_client')
                         ->join('Operateur', 'Operateur.id_operateur = Client.id_operateur');

        if ($idOperateur !== null) {
            $builder->where('Client.id_operateur', $idOperateur);
        }

        if ($recherche) {
            $builder->like('Client.numero_telephone', $recherche);
        }

        return $builder->orderBy('Client.numero_telephone')->findAll();
---
SELECT `Compte`.`id_compte`, `Compte`.`solde`, `Client`.`id_client`, `Client`.`numero_telephone`, `Client`.`nom`, `Operateur`.`nom` as `nom_operateur`
FROM `Compte`
JOIN `Client` ON `Client`.`id_client` = `Compte`.`id_client`
JOIN `Operateur` ON `Operateur`.`id_operateur` = `Client`.`id_operateur`
ORDER BY `Client`.`numero_telephone`