app/Models/OperationModel.php

SELECT *
FROM `Compte`
WHERE `id_client` = 5
---
    public function getHistoriqueByClient(int $id_client, int $limite = 50): array
    {
        $db = \Config\Database::connect();

        // On recupere d'abord le(s) id_compte du client (normalement un seul)
        $comptes = $db->table('Compte')->where('id_client', $id_client)->get()->getResultArray();