app/Models/OperationModel.php

SELECT SUM(frais_appliques) as total
FROM `Operation`
JOIN `statut_operation` ON `statut_operation`.`id_statut` = `Operation`.`id_statut`
WHERE `statut_operation`.`libelle` = 'reussie'
 LIMIT 1
---
    public function getGainsParType(?string $dateDebut = null, ?string $dateFin = null)
    {
        $builder = $this->select('TypeOperation.libelle as type_operation,
                                   SUM(Operation.frais_appliques) as total_frais,
                                   COUNT(Operation.id_operation) as nombre_operations')
                         ->join('TypeOperation', 'TypeOperation.id_type_operation = Operation.id_type_operation')
                         ->join('statut_operation', 'statut_operation.id_statut = Operation.id_statut')
                         ->where('statut_operation.libelle', 'reussie')
                         ->where('TypeOperation.libelle !=', 'depot'); // pas de frais sur les dépôts

        if ($dateDebut) {
            $builder->where('Operation.date_operation >=', $dateDebut);
        }
        if ($dateFin) {
            $builder->where('Operation.date_operation <=', $dateFin);
        }

        return $builder->groupBy('TypeOperation.libelle')->findAll();

SELECT *
FROM `BaremeFrais`
WHERE `id_type_operation` = 1
AND `montant_min` <= 20000
AND `montant_max` >= 20000
---
    public function getFrais(int $id_type_operation, float $montant): float
    {
        $db = \Config\Database::connect();

        $bareme = $db->table('BaremeFrais')
            ->where('id_type_operation', $id_type_operation)
            ->where('montant_min <=', $montant)
            ->where('montant_max >=', $montant)
            ->get()
            ->getRowArray();