app/Models/OperationModel.php

SELECT `id_operateur`, `nom_operateur`, `type_operation`, `portee`, SUM(frais_appliques) as total_frais, COUNT(id_operation) as nombre_operations
FROM `vue_gains_operations`
WHERE `id_operateur` = 2
GROUP BY `id_operateur`, `type_operation`, `portee`
ORDER BY `nom_operateur`, `type_operation`
---
    public function getGainsParOperateurEtType(?string $dateDebut = null, ?string $dateFin = null, ?int $idOperateur = null)
    {
        $builder = $this->db->table('vue_gains_operations')
                            ->select('id_operateur, nom_operateur, type_operation, portee,
                                    SUM(frais_appliques) as total_frais,
                                    COUNT(id_operation) as nombre_operations');

        if ($idOperateur !== null) {
            $builder->where('id_operateur', $idOperateur);
        }

        if ($dateDebut) {
            $builder->where('date_operation >=', $dateDebut);
        }
        if ($dateFin) {
            $builder->where('date_operation <=', $dateFin);
        }

        return $builder->groupBy('id_operateur, type_operation, portee')
                        ->orderBy('nom_operateur')
                        ->orderBy('type_operation')
                        ->get()
                        ->getResultArray();

SELECT `Operation`.`id_operation`, `Operation`.`id_type_operation`, `Operation`.`montant`, `Operation`.`frais_appliques`, `Operation`.`date_operation`, `TypeOperation`.`libelle` AS `type_operation`, `ClientSource`.`id_operateur` AS `id_operateur_source`, `OperateurSource`.`nom` AS `nom_operateur_source`, `Operation`.`id_operateur_destination`, `OperateurDest`.`nom` AS `nom_operateur_destination`
FROM `Operation`
JOIN `TypeOperation` ON `TypeOperation`.`id_type_operation` = `Operation`.`id_type_operation`
JOIN `statut_operation` ON `statut_operation`.`id_statut` = `Operation`.`id_statut`
LEFT JOIN `Compte` AS `CompteSource` ON `CompteSource`.`id_compte` = `Operation`.`id_compte_source`
LEFT JOIN `Client` AS `ClientSource` ON `ClientSource`.`id_client` = `CompteSource`.`id_client`
LEFT JOIN `Operateur` AS `OperateurSource` ON `OperateurSource`.`id_operateur` = `ClientSource`.`id_operateur`
LEFT JOIN `Operateur` AS `OperateurDest` ON `OperateurDest`.`id_operateur` = `Operation`.`id_operateur_destination`
WHERE `statut_operation`.`libelle` = 'reussie'
AND `TypeOperation`.`libelle` != 'depot'
ORDER BY `Operation`.`date_operation` ASC
---
    public function getOperationsPourGains(?string $dateDebut = null, ?string $dateFin = null): array
    {
        $builder = $this->db->table('Operation')
            ->select('Operation.id_operation,
                Operation.id_type_operation,
                Operation.montant,
                Operation.frais_appliques,
                Operation.date_operation,
                TypeOperation.libelle AS type_operation,
                ClientSource.id_operateur AS id_operateur_source,
                OperateurSource.nom AS nom_operateur_source,
                Operation.id_operateur_destination,
                OperateurDest.nom AS nom_operateur_destination')
            ->join('TypeOperation', 'TypeOperation.id_type_operation = Operation.id_type_operation')
            ->join('statut_operation', 'statut_operation.id_statut = Operation.id_statut')
            ->join('Compte AS CompteSource', 'CompteSource.id_compte = Operation.id_compte_source', 'left')
            ->join('Client AS ClientSource', 'ClientSource.id_client = CompteSource.id_client', 'left')
            ->join('Operateur AS OperateurSource', 'OperateurSource.id_operateur = ClientSource.id_operateur', 'left')
            ->join('Operateur AS OperateurDest', 'OperateurDest.id_operateur = Operation.id_operateur_destination', 'left')
            ->where('statut_operation.libelle', 'reussie')
            ->where('TypeOperation.libelle !=', 'depot');