app/Models/PrefixeModel.php

    public function getAllWithOperateur()
    {
        return $this->select('Prefixe.id_prefixe, Prefixe.code, Prefixe.actif, Operateur.nom as nom_operateur')
                    ->join('Operateur', 'Operateur.id_operateur = Prefixe.id_operateur')
                    ->findAll();
---
SELECT `Prefixe`.`id_prefixe`, `Prefixe`.`code`, `Prefixe`.`actif`, `Operateur`.`nom` as `nom_operateur`
FROM `Prefixe`
JOIN `Operateur` ON `Operateur`.`id_operateur` = `Prefixe`.`id_operateur`