app/Models/ReductionMemeOperateurModel.php

    public function getPourcentage() {
        return $this->select('pourcentage')
                    ->findAll();
---
SELECT `pourcentage`
FROM `ReductionMemeOperateur`