app/Models/TypeOperationModel.php

    public function getTypesAvecFrais()
    {
        return $this->where('libelle !=', 'depot')->findAll();
---
SELECT *
FROM `TypeOperation`
WHERE `libelle` != 'depot'